CL254/assignment/HW 4 Q1/Part a/blt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          30;
        startFace       1150;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          10;
        startFace       1180;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1190;
    }
    left
    {
        type            patch;
        nFaces          20;
        startFace       1210;
    }
    right
    {
        type            patch;
        nFaces          20;
        startFace       1230;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1200;
        startFace       1250;
    }
)

// ************************************************************************* //
